; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	thermograph0 - mode
	thermograph1 - mode
	GroundStation1 - direction
	Star4 - direction
	GroundStation5 - direction
	GroundStation6 - direction
	Star7 - direction
	GroundStation3 - direction
	Star0 - direction
	Star2 - direction
	Planet8 - direction
	Phenomenon9 - direction
	Planet10 - direction
	Star11 - direction
	Planet12 - direction
	Star13 - direction
)
(:init
	(supports instrument0 thermograph0)
	(supports instrument0 thermograph1)
	(calibration_target instrument0 Star7)
	(calibration_target instrument0 GroundStation6)
	(supports instrument1 thermograph0)
	(supports instrument1 thermograph1)
	(calibration_target instrument1 GroundStation3)
	(supports instrument2 thermograph0)
	(supports instrument2 thermograph1)
	(calibration_target instrument2 Star2)
	(calibration_target instrument2 Star0)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star11)
)
(:goal (and
	(have_image Planet8 thermograph1)
	(have_image Phenomenon9 thermograph1)
	(have_image Planet10 thermograph0)
	(have_image Star11 thermograph0)
	(have_image Planet12 thermograph0)
	(have_image Star13 thermograph0)
))

)

; plan
1. (turn_to satellite0 groundstation6 star11)
   deleted: (pointing satellite0 star11)
   added: (pointing satellite0 groundstation6)
   goals met: 0 of 6
2. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 6
3. (calibrate satellite0 instrument0 groundstation6)
   added: (calibrated instrument0)
   goals met: 0 of 6
4. (turn_to satellite0 planet10 groundstation6)
   deleted: (pointing satellite0 groundstation6)
   added: (pointing satellite0 planet10)
   goals met: 0 of 6
5. (take_image satellite0 planet10 instrument0 thermograph0)
   added: (have_image planet10 thermograph0)
   goals met: 1 of 6
6. (turn_to satellite0 phenomenon9 planet10)
   deleted: (pointing satellite0 planet10)
   added: (pointing satellite0 phenomenon9)
   goals met: 1 of 6
7. (take_image satellite0 phenomenon9 instrument0 thermograph1)
   added: (have_image phenomenon9 thermograph1)
   goals met: 2 of 6
8. (turn_to satellite0 planet12 phenomenon9)
   deleted: (pointing satellite0 phenomenon9)
   added: (pointing satellite0 planet12)
   goals met: 2 of 6
9. (take_image satellite0 planet12 instrument0 thermograph0)
   added: (have_image planet12 thermograph0)
   goals met: 3 of 6
10. (turn_to satellite0 planet8 planet12)
   deleted: (pointing satellite0 planet12)
   added: (pointing satellite0 planet8)
   goals met: 3 of 6
11. (take_image satellite0 planet8 instrument0 thermograph1)
   added: (have_image planet8 thermograph1)
   goals met: 4 of 6
12. (turn_to satellite0 star11 planet8)
   deleted: (pointing satellite0 planet8)
   added: (pointing satellite0 star11)
   goals met: 4 of 6
13. (take_image satellite0 star11 instrument0 thermograph0)
   added: (have_image star11 thermograph0)
   goals met: 5 of 6
14. (turn_to satellite0 star13 star11)
   deleted: (pointing satellite0 star11)
   added: (pointing satellite0 star13)
   goals met: 5 of 6
15. (take_image satellite0 star13 instrument0 thermograph0)
   added: (have_image star13 thermograph0)
   goals met: 6 of 6
